app/views/shared/_country_list_options.html.erb

<%= Country.all.each do |country| %>
---
SELECT `countries`.* FROM `countries`