app/views/unsubscribes/account.html.erb

            <%= handle_error_text(@unsubscribe, :unsubscribe_reason_id) %>
            <%= f.select :unsubscribe_reason_id, options_from_collection_for_select(UnsubscribeReason.all, :id, :name), { prompt: "Choose" }, class: "form-control", required: true %>
---
SELECT `unsubscribe_reasons`.* FROM `unsubscribe_reasons`