app/controllers/car_models_controller.rb

	def index
		@car_maker = CarMaker.find(params[:car_maker_id])
---
SELECT  `car_makers`.* FROM `car_makers`  WHERE `car_makers`.`id` = 3 LIMIT 1