app/controllers/cars_controller.rb

INSERT INTO `cars` (`car_maker_id`, `car_model_id`, `color_id`, `created_at`, `level_of_comfort`, `number_of_seats`, `updated_at`, `user_id`) VALUES (1, 1, 1, '2014-05-29 13:31:19', 2, 4, '2014-05-29 13:31:19', 1)
---
	def create
		@car = current_user.cars.build(car_params)
		if @car.save

SELECT `car_categories`.* FROM `car_categories`
SELECT `car_makers`.* FROM `car_makers`  WHERE `car_makers`.`id` IN (1)
SELECT `car_models`.* FROM `car_models`  WHERE `car_models`.`id` IN (1)
SELECT `cars`.* FROM `cars`  WHERE `cars`.`user_id` = 1
---
	def load_cars
		@cars = current_user.cars.includes(:car_model, :car_maker, :car_category)