app/controllers/profile_controller.rb

	def upload_photo
		@profile = Profile.find(params[:id])
		if @profile.update(profile_photo_params)
---
SELECT  `profiles`.* FROM `profiles`  WHERE `profiles`.`id` = 1 LIMIT 1
UPDATE `profiles` SET `photo` = '2013-09-13_0000.png', `updated_at` = '2014-05-29 13:30:42' WHERE `profiles`.`id` = 1