app/controllers/rides_controller.rb

	def set_car
		if @ride.update(car_id: params[:ride][:car_id])
---
UPDATE `rides` SET `car_id` = 1, `detour_preferences` = 1, `full_completed` = 1, `general_details` = '', `is_details_same` = 1, `leaving_delay` = 0, `max_luggage_size` = 'medium', `specific_details` = '', `total_distance` = '878 km', `total_time` = '9 hours 15 mins', `updated_at` = '2014-06-27 18:05:35' WHERE `rides`.`id` = 1

	def create_offer_1

		if user_signed_in?
			@ride = current_user.rides.build(offer_1_ride_params)
		else
			@ride = Ride.new(offer_1_ride_params)
		end

		respond_to do |format|

			if @ride.save
---
INSERT INTO `rides` (`created_at`, `departure_date`, `number_of_seats`, `return_date`, `updated_at`, `user_id`) VALUES ('2014-06-27 18:05:23', '2014-06-27 23:05:00', 3, '2014-06-30 23:05:00', '2014-06-27 18:05:23', 1)

	def create_offer_2
		respond_to do |format|

			if user_signed_in?
				@ride = current_user.rides.find(params[:id])
				if @ride.update(offer_2_ride_params)
					total_price = @ride.calculate_total_price
					if @ride.full_completed < 2
						@ride.update!(created_at: Time.now, total_price: total_price)
						@ride.send_published_confirmation
						flash[:notice] = t('rides.published', ride_id: @ride.id)
						format.html { redirect_to publication_ride_path(@ride.id) }
					else
						@ride.update!(total_price: total_price)
						@ride.send_updated_confirmation
						flash[:notice] = t('rides.updated', ride_id: @ride.id)
						format.html { redirect_to publication_ride_path(@ride.id) }
					end
					format.json { render :show, status: :created, location: @ride }
				else
					@routes = @ride.routes
					@locations = @ride.locations
					format.html { render 'offer_seat_2', danger: "Please correct the error(s) listed below" }
					format.json { render json: @ride.errors, status: :unprocessable_entity }
				end
			else
				@ride = Ride.find(params[:id])
---
SELECT  `rides`.* FROM `rides`  WHERE `rides`.`user_id` = 1 AND `rides`.`id` = 1 LIMIT 1
SELECT `routes`.* FROM `routes`  WHERE `routes`.`ride_id` = 1 AND `routes`.`id` IN (1)

	def set_ride
		@ride = Ride.find(params[:id])
---
SELECT  `rides`.* FROM `rides`  WHERE `rides`.`id` = 1 LIMIT 1

	def set_user_ride_or_default_ride
		@ride = Ride.find(params[:id])
		if  @ride.user_id.present? && @ride.user_id !=  current_user.id
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1