app/controllers/unsubscribes_controller.rb

	def delete_account
		begin
			@unsubscribe = current_user.build_unsubscribe(unsubscribe_params)
			if @unsubscribe.save
				UserMailer.delete_account(@unsubscribe.unsubscribe_reason.name, @unsubscribe.comment, current_user).deliver
---
INSERT INTO `unsubscribes` (`comment`, `created_at`, `recommend`, `unsubscribe_reason_id`, `updated_at`, `user_id`) VALUES ('asdsa', '2014-05-30 18:07:05', 1, 1, '2014-05-30 18:07:05', 1)
DELETE FROM `users` WHERE `users`.`id` = 1