app/controllers/users_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
	def load_public_profile
		@user = User.find(params[:id])