app/views/cars/_form.html.erb

SELECT `car_makers`.* FROM `car_makers`
---
        <div class="col-sm-4">
          <%= f.select :car_maker_id, options_for_select(CarMaker.all.try(:each).try(:collect) { |maker| [maker.name, maker.id] }, @car.car_maker_id), { prompt: "Choose" }, class: "form-control car-maker-select" %>

SELECT  `colors`.* FROM `colors`  WHERE `colors`.`name` = 'black' LIMIT 1
---
        <div class="col-sm-4">
          <%= f.select :color_id, options_for_select(Color.all.try(:each).try(:collect) { |col| [col.name, col.id] }, @car.car_maker_id || Color.find_by(name: "black")), {}, class: "form-control" %>

SELECT `car_categories`.* FROM `car_categories`
---
        <div class="col-sm-4">
          <%= f.select :car_category_id, options_for_select(CarCategory.all.try(:each).try(:collect) { |cat| [cat.name, cat.id] }, @car.car_category_id), { prompt: "Choose" }, class: "form-control" %>