app/controllers/users/registrations_controller.rb

UPDATE `users` SET `current_sign_in_at` = '2014-05-23 16:17:02', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_at` = '2014-05-23 16:17:02', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2014-05-23 16:17:02' WHERE `users`.`id` = 1
---
	def create
		build_resource(sign_up_params)
		resource_saved = resource.save
		yield resource if block_given?
		if resource_saved
			mailchimp(resource.email) if resource.receive_updates?

			if resource.active_for_authentication?
				set_flash_message :notice, :signed_up if is_flashing_format?
				sign_up(resource_name, resource)
				if session[:ride_id].present?
					ride = Ride.find(session[:ride_id]) rescue nil
					session.delete(:ride_id)
					if ride.present?
						ride.update!(user_id: resource.id)