app/views/profile/address.html.erb

        <div class="col-sm-4">
          <%= f.select :country_id, options_for_select(Country.all.try(:each).try(:collect) { |country| [country.name, country.id] }, Country.find_by(name: GlobalConstants::DEFAULT_COUNTRY).id), { prompt: "Choose" }, class: "form-control" %>
---
SELECT  `countries`.* FROM `countries`  WHERE `countries`.`name` = 'United Kingdom' LIMIT 1