app/views/profile/verifications.html.erb

    </div>
    <% if @user.phone_number.verified_no.blank? %>
---
SELECT  `phone_numbers`.* FROM `phone_numbers`  WHERE `phone_numbers`.`user_id` = 1 LIMIT 1