app/views/rides/_form2.html.erb

SELECT  `rides`.* FROM `rides`  WHERE `rides`.`id` = 1 LIMIT 1
---
          <%= ride_form.hidden_field :enable_routes_validation, value: true %>
          <%= ride_form.hidden_field :full_completed, value: (Ride.find(@ride.id).full_completed + 1) %>

SELECT `cars`.* FROM `cars`  WHERE `cars`.`user_id` = 1
---
            <% if current_user.present? %>
                <% if current_user.cars.present? %>