app/views/layouts/_navigation_links.html.erb

SELECT DISTINCT COUNT(DISTINCT `message_threads`.`id`) FROM `message_threads` INNER JOIN `messages` ON `messages`.`message_thread_id` = `message_threads`.`id` WHERE `message_threads`.`user_id` = 1 AND (message_threads.status = 0 AND message_threads.unread = 1 AND messages.message_type = 0)
---
    <li>
        <% @unread_received_message_threads_count =  current_user.message_threads.joins(:messages).distinct.where("message_threads.status = ? AND message_threads.unread = ? AND messages.message_type = ?", GlobalConstants::MessageThreads::STATUS[:active], true, GlobalConstants::Messages::TYPE[:received]).count %>